"Thousands of candles can be lighted from a single candle, and the life of the candle will not be shortened. Happiness never decreases by being shared.",

"The way is not in the sky. The way is in the heart.",

"You will not be punished for your anger, you will be punished by your anger.",

"All that we are is the result of what we have thought. The mind is everything. What we think, we become.",

"Holding on to anger is like grasping a hot coal with the intent of throwing it at someone else; you are the one getting burned."


"The rule of friendship means there should be mutual sympathy between them, each supplying what the other lacks and trying to benefit the other, always using friendly and sincere words."

"A good friend who points out mistakes and imperfections and rebukes evil is to be respected as if he reveals a secret of hidden treasure."

"The secret of health for both mind and body is not to mourn for the past, not to worry about the future, or not to anticipate troubles, but to live in the present moment wisely and earnestly."

"What we are today comes from our thoughts of yesterday, and our present thoughts build our life of tomorrow: Our life is the creation of our mind."

"There is nothing more dreadful than the habit of doubt. Doubt separates people. It is a poison that disintegrates friendships and breaks up pleasant relations. It is a thorn that irritates and hurts; it is a sword that kills."

"Endurance is one of the most difficult disciplines, but it is to the one who endures that the final victory comes."


"It is better to conquer yourself than to win a thousand battles. Then the victory is yours. It cannot be taken from you, not by angels or by demons, heaven or hell."

"Anger will never disappear so long as thoughts of resentment are cherished in the mind. Anger will disappear just as soon as thoughts of resentment are forgotten."


"Believe nothing, no matter where you read it, or who said it, no matter if I have said it, unless it agrees with your own reason and your own common sense."

"There has to be evil so that good can prove its purity above it."

"Love the whole world as a mother lovers her only child."

"We are what we think. All that we are arises With our thoughts. With our thoughts, We make our world."

"Those who are free of resentful thoughts surely find peace."

"Meditation brings wisdom; lack of mediation leaves ignorance. Know well what leads you forward and what hold you back, and choose the path that leads to wisdom."

"Your work is to discover your work and then with all your heart to give yourself to it."

"Work out your own salvation. Do not depend on others."

"Health is the greatest gift, contentment the greatest wealth, faithfulness the best relationship."

"Fashion your life as a garland of beautiful deeds."

"Hatred does not cease through hatred at any time. Hatred ceases through love. This is an unalterable law."

"Hatred does not cease by hatred, but only by love; this is the eternal rule."

"You yourself, as much as anybody in the entire universe, deserve your love and affection."

"He insulted me, he cheated me, he beat me, he robbed me' -- those who are free of resentful thoughts surely find peace."

"A family is a place where minds come in contact with one another."

"We are formed and molded by our thoughts. Those whose minds are shaped by selfless thoughts give joy when they speak or act. Joy follows them like a shadow that never leaves them."

"Believe nothing merely because you have been told it. Do not believe what your teacher tells you merely out of respect for the teacher. But whatsoever, after due examination and analysis, you find to be kind, conducive to the good, the benefit, the welfare of all beings -- that doctrine believe and cling to, and take it as your guide."

"Be vigilant; guard your mind against negative thoughts."

"Never in this world can hatred be stilled by hatred; it will be stilled only by non-hatred -- this is the law of eternal."

"I reached in experience the nirvana which is unborn, unrivalled, secure from attachment, undecaying and unstained. This condition is indeed reached by me which is deep, difficult to see, difficult to understand, tranquil, excellent, beyond the reach of mere logic, subtle, and to be realized only by the wise."

"On life's journey faith is nourishment, virtuous deeds are a shelter, wisdom is the light by day and right mindfulness is the protection by night. If a man lives a pure life, nothing can destroy him."

"There is nothing so disobedient as an undisciplined mind, and there is nothing so obedient as a disciplined mind."

"The Buddhas do but tell the way; it is for you to swelter at the task."

"Let the wise guard their thoughts, which are difficult to perceive, extremely subtle, and wander at will. Thought which is well guarded is the bearer of happiness."

"Besides the respect of the lives of human beings, all the animals and plants should be on the list too. That is the real humanitarianism."

"A jug fills drop by drop."

"Temperance is a tree which as for its root very little contentment, and for its fruit calm and peace."

"Through zeal, knowledge is gotten; through lack of zeal, knowledge is lost."

"As irrigators lead water where they want, as archers make their arrows straight, as carpenters carve wood, the wise shape their minds."

"You cannot travel on the path until you become the path itself."

"When one has the feeling of dislike for evil, when one feels tranquil, one finds pleasure in listening to good teachings; when one has these feelings and appreciates them, one is free of fear."

"As the Fletcher whittles and makes straight his arrows, so the master directs his straying thoughts."

"Besides the respect of the lives of human beings, all the animals and plants should be on the list too. That is the real humanitarianism."

"It is wrong to think that misfortunes come from the east or from the west; they originate within one's own mind. Therefore, it is foolish to guard against misfortunes from the external world and leave the inner mind uncontrolled."

"Follow then the shining ones, the wise, the awakened, the loving, for they know how to work and forbear."

"There is nothing more dreadful than the habit of doubt. Doubt separates people. It is a poison that disintegrates friendships and breaks up pleasant relations. It is a thorn that irritates and hurts; it is a sword that kills."

"He is not the same, nor is he another."

"If a man who enjoys a lesser happiness beholds a greater one, let him leave aside the lesser to gain the greater."

"LOVE CANT BE OF A PERSON, IT HAS TO B EVERY BODYS."

"The whole secret of existence is to have no fear. Never fear what will become of you, depend on no one. Only the moment you reject all help are you freed."

"They are not following dharma who resort to violence to achieve their purpose. But those who lead others through nonviolent means, knowing right and wrong, may be called guardians of the dharma."

"This life of separateness may be compared to a dream, a phantasm, a bubble, a shadow, a drop of dew, a flash of lightning."

"Watering the flowers and the trees, whispering to them, talking to them. Then, they will grow to be more bright and luxuriant."

"Believe nothing, O monks, merely because you have been told it or because it is traditional, or because you yourselves have imagined it. Do not believe what your teacher tells you merely out of respect for the teacher. But whatsoever, after due examination and analysis, you find to be conducive to the good, the benefit, the welfare of all beingsthat doctrine believe and cling to, and take it as your guide."

"Wish I am free from barriers when I die, and Buddha will welcome me from far away."

"A family is a place where minds come in contact with one another. If these minds love one another the home will be as beautiful as a flower garden. But if these minds get out of harmony with one another it is like a storm that plays havoc with the garden."

"All beings are not only the parents in the past. They will become the Buddha in the future. If you free their lives, you are Buddha."

"Buddha is in our hearts. Buddha is in our mouths. Buddha is in our daily lives."

"Care about your children. Just bless them instead of worrying, as every child is the little Buddha who helps his parents to grow up."

"Doing the good deeds is like the grass in the garden. You don't see its growth. But, it does by days. Doing the wicked deeds is like the hone. You don't see its damage. But, it does by days."

"Giving the best to others are giving the best to ourselves. The value of life is not based on how long we live. But, how much can we contribute to others in our society ?"

"Give the people --- confidence. Give the people --- delight. Give the people --- hope. Give the people --- the best."

"Health is the first benefit. Content is the first fortune. Friendliness is the first kindness. Nirvana is the first happiness."

"Karma grows from our hearts. Karma terminates from our hearts."

"Mankind have love, animals have affection. The harmonious and beautiful world is revealed."

"No light is brighter than wisdom. Wisdom is the light in the world."

"Observe the life by cause and consequence. Explore the life by wisdom. Treat the life by equality. Complete the life by love."

"Please, try to eat a bit less meat, a bit more veggies from today. Let it become a habit gradually until not to eat meat anymore. Then, observe the changing of the body and spirit after eating veggies, fruits and grains ?"

"The easiest beneficence is a smile. The simplest release is to have a vegetarian meal."

"There are having flowers in Spring, breezes in Summer, moon in Autumn, snows in Winter. If there is nothing worrying over you, it will be the best seasons at all times."

"Thousands upon thousands of lights is inferior to a light of heart."

"To eat meat is just a habit after we were born. In fact, we are not born to eat meat."

"Enjoy the good health. Bring the truth happiness. Care of his own family. Give the peace to all. Firstly, one must discipline and control his own mind. If he can do so, the enlightenment, wisdom and virtue will go to him naturally."

"It takes hundred of years sitting together in the same boat. It takes thousand of years sharing the same bed with. It calls : the predestined affinity."

"Prefer the afterlife better than this one. Never let this life better than next one."
